package bean;

import java.util.List;

/**
 * 1.类的用途
 * 2.@author:Sunyubo
 * 3.@ 2016/12/21.
 */

public class Bean {


    /**
     * error_code : 0
     * reason : Success
     * result : {"data":[{"content":"有一女挤上火车，看到自己座位坐一帅哥。她核对自己的票，客气地说：\u201c您坐错位置了吧？\u201d 帅哥拿出票嚷嚷着，\u201c看清楚！这是我的座你瞎了？\u201d 女仔细地看了看他的票。女不说话了！帅哥跷着腿，不屑地说，\u201c年纪轻轻，学人搭讪！\u201d 女不再回应，默默退到帅哥身旁。 不久，女见火车开动了，对帅哥说了一声：\u201c~~你没坐错座，你坐错车了！\u2026\u2026 有一种忍叫做让你后悔都来不及！","hashId":"6bfc508b95aba9b05d39259d7d65cd32","unixtime":1482314630,"updatetime":"2016-12-21 18:03:50"},{"content":"和妈妈坐沙发上，我打开APP看各大主播直播间人满为患，礼物各种刷。我对妈妈说：妈、我也开直播吧。我妈用深邃的目光看着我说：孩子、做善事有很多种，就你那歌声，人家哭都比你唱歌好听。。。额 妈、咱还能愉快的聊天不。。。。","hashId":"6a57a5e8b7fd308311589213e771dbb9","unixtime":1482314630,"updatetime":"2016-12-21 18:03:50"},{"content":"每次吵架，丈夫总是让着妻子，一次，妻子问\u201c你为什么老让着我，明明是我做错事？\u201d丈夫：\u201c因为你是我的，就算我吵赢了，又能怎样？赢了道理，输了感情！\u201d两人世界里总要一个闹着一个笑着一个吵着一个哄着，如果一个人总是输，不是口才不够好，是爱你，一个人输了，两个人才能赢。","hashId":"39713240989f4b0f16c26ae11bbeb022","unixtime":1482314630,"updatetime":"2016-12-21 18:03:50"},{"content":"和在外地教书的妹妹电话（她吃学校食堂）。。。妹、你吃午饭了吗？菜味道好吗？我妹回：哥、食堂的菜只能问熟了吗。这......貌似有道理哦！！！","hashId":"b080ca1281bcda9926fbb220f1e401c2","unixtime":1482314630,"updatetime":"2016-12-21 18:03:50"},{"content":"假如潘金莲不开窗户，就不会遇见西门庆； 不遇西门庆，就不会出轨； 不出轨，武松就不会逼上梁山。 武松不上梁山，方腊就不会被擒； 方腊不被擒，就可灭大宋江山； 没有了大宋江山，就不会有靖康耻； 金兵就不会入关，就不会有大清朝； 没有大清朝，中国就不会闭关锁国、不会有战争和八国联军入侵。 那么，中国，将是世界上唯一的超级大国！美国等其他诸侯神马的都TM是浮云！ 唉！金莲呀，没事你TM开什么窗户啊~~","hashId":"3eab1e5d72d099ad7bbff7639dc164ad","unixtime":1482314630,"updatetime":"2016-12-21 18:03:50"},{"content":"学生：口字加舍字念啥？老师：念啥。学生一脸茫然：？老师，我不知道，所以才问你。老师：这个字它念啥。学生：我真不知道它念啥。老师沉住气：你想知道它念啥，但是你又不知道它念啥，它就念啥。学生一脸茫然：？？老师终于火了：B孩子，老师不认识，自己查字典！","hashId":"4dce4a421c8e49598d1799e4bf78fb17","unixtime":1482314630,"updatetime":"2016-12-21 18:03:50"},{"content":"今天去看下午场电影，发现整个厅貌 似就我一人！这包场的感觉倍 爽，我从前排换到中间、从左边换到右边、玩自 拍、模仿电影讲对白，站到屏幕前亲 吻 女 主\u2026 正玩得挺 嗨，在最后排角落里站起来一 对 男 女快速离开，隐 约有声音传来：换个地方吧，这人脑 袋有毛 病\u2026","hashId":"7c99ab14a711e15561d64dcf3fa86a65","unixtime":1482314630,"updatetime":"2016-12-21 18:03:50"},{"content":"刚才和男友再沙发上玩手机，他和我说不要经常玩手机，我正感动呢，他接了一句：对手机不好，玩坏了我还得给你买\u2026\u2026有没有人给我买把西瓜刀","hashId":"837b4b13a26a1599dd97b608008f6cd5","unixtime":1482314630,"updatetime":"2016-12-21 18:03:50"},{"content":"单位有一小伙，不知啥原因，不怕冷，冬天别人要穿毛衣棉袄，而他只穿一件T恤外加一件单衣即可，关键他还不会感冒生病。 昨天去相亲，为了显示他的身体好，特意穿得比平时还少\u2026 结果杯 具了，女孩妈妈不同意：都这么冷的天，连件厚衣服都买不起，不是没钱就是特抠门\u2026","hashId":"ca98aa20ea196f5552680c0ccf36cc70","unixtime":1482314630,"updatetime":"2016-12-21 18:03:50"},{"content":"一直觉得电视里男女主在车站分别时一人上车一人哭着追火车的桥段好浪漫好煽情。今天我也想这样体验一下，于是去车站送人。才发现电视里的童话都是骗人的。我TM没买票连车站都进不去\u2026\u2026","hashId":"47d4286356f678f3eb127d8f586c2076","unixtime":1482314630,"updatetime":"2016-12-21 18:03:50"}]}
     */

    public int error_code;
    public String reason;
    public ResultBean result;

    public static class ResultBean {
        public List<DataBean> data;

        public static class DataBean {
            /**
             * content : 有一女挤上火车，看到自己座位坐一帅哥。她核对自己的票，客气地说：“您坐错位置了吧？” 帅哥拿出票嚷嚷着，“看清楚！这是我的座你瞎了？” 女仔细地看了看他的票。女不说话了！帅哥跷着腿，不屑地说，“年纪轻轻，学人搭讪！” 女不再回应，默默退到帅哥身旁。 不久，女见火车开动了，对帅哥说了一声：“~~你没坐错座，你坐错车了！…… 有一种忍叫做让你后悔都来不及！
             * hashId : 6bfc508b95aba9b05d39259d7d65cd32
             * unixtime : 1482314630
             * updatetime : 2016-12-21 18:03:50
             */

            public String content;
            public String hashId;
            public int unixtime;
            public String updatetime;
        }
    }
}
